ir_version: 5
producer_name: "skl2onnx"
producer_version: "1.5.2"
domain: "ai.onnx"
model_version: 0
doc_string: ""
graph {
  node {
    input: "input"
    output: "cast_input"
    name: "Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "cast_input"
    input: "coefficient"
    output: "mul_result"
    name: "MatMul"
    op_type: "MatMul"
    domain: ""
  }
  node {
    input: "mul_result"
    input: "intercepts"
    output: "add_result"
    name: "Add"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "add_result"
    output: "next_activations"
    name: "Sigmoid"
    op_type: "Sigmoid"
    domain: ""
  }
  node {
    input: "next_activations"
    input: "coefficient1"
    output: "mul_result1"
    name: "MatMul1"
    op_type: "MatMul"
    domain: ""
  }
  node {
    input: "mul_result1"
    input: "intercepts1"
    output: "add_result1"
    name: "Add1"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "add_result1"
    output: "out_activations_result"
    name: "Sigmoid1"
    op_type: "Softmax"
    domain: ""
  }
  node {
    input: "classes"
    input: "argmax_output"
    output: "array_feature_extractor_result"
    name: "ArrayFeatureExtractor"
    op_type: "ArrayFeatureExtractor"
    domain: "ai.onnx.ml"
  }
  node {
    input: "out_activations_result"
    output: "probabilities"
    name: "Identity"
    op_type: "Identity"
    domain: ""
  }
  node {
    input: "probabilities"
    output: "argmax_output"
    name: "ArgMax"
    op_type: "ArgMax"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "array_feature_extractor_result"
    input: "shape_tensor"
    output: "reshaped_result"
    name: "Reshape"
    op_type: "Reshape"
    domain: ""
  }
  node {
    input: "reshaped_result"
    output: "label"
    name: "Cast1"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
    domain: ""
  }
  node {
    input: "label"
    output: "output_label"
    name: "Cast2"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
    domain: ""
  }
  node {
    input: "probabilities"
    output: "output_probability"
    name: "ZipMap"
    op_type: "ZipMap"
    attribute {
      name: "classlabels_int64s"
      ints: 0
      ints: 1
      ints: 2
      ints: 3
      ints: 4
      ints: 5
      ints: 6
      ints: 7
      ints: 8
      ints: 9
      type: INTS
    }
    domain: "ai.onnx.ml"
  }
  name: "fda9d68e632e4df8bb7f5420d5c43ef4"
  initializer {
    dims: 64
    dims: 15
    data_type: 1
    float_data: -0.02639530971646309
    float_data: 0.07008524984121323
    float_data: -0.15901367366313934
    float_data: -0.06287803500890732
    float_data: -0.11236699670553207
    float_data: -0.12967714667320251
    float_data: -0.09980066120624542
    float_data: -0.04912715032696724
    float_data: -0.03283827751874924
    float_data: 0.012347607873380184
    float_data: -0.025704234838485718
    float_data: 0.05891834571957588
    float_data: -0.0940137729048729
    float_data: 0.12027920037508011
    float_data: -0.1503380686044693
    float_data: -0.06377344578504562
    float_data: 0.029366882517933846
    float_data: 0.0073934923857450485
    float_data: -0.18251073360443115
    float_data: -0.12501400709152222
    float_data: 0.08534644544124603
    float_data: 0.14290578663349152
    float_data: -0.15711341798305511
    float_data: 0.12046793103218079
    float_data: 0.17569920420646667
    float_data: 0.05884985998272896
    float_data: -0.08875655382871628
    float_data: -0.08369556814432144
    float_data: 0.03038007579743862
    float_data: 0.06521168351173401
    float_data: -0.3217759430408478
    float_data: 0.24258974194526672
    float_data: 0.06463690847158432
    float_data: 0.30400988459587097
    float_data: 0.260381817817688
    float_data: -0.1479070484638214
    float_data: -0.0330096036195755
    float_data: 0.21756525337696075
    float_data: -0.06569287180900574
    float_data: 0.04156486690044403
    float_data: 0.007428817451000214
    float_data: 0.0556967630982399
    float_data: -0.008923198096454144
    float_data: 0.34625232219696045
    float_data: -0.10298211127519608
    float_data: -0.03937004134058952
    float_data: 0.3298995792865753
    float_data: -0.22479648888111115
    float_data: -0.27124661207199097
    float_data: -0.3888208270072937
    float_data: -0.32368436455726624
    float_data: -0.11455097794532776
    float_data: 0.1990921050310135
    float_data: -0.08754868060350418
    float_data: 0.0480545274913311
    float_data: -0.007866163738071918
    float_data: -0.2576528489589691
    float_data: 0.17313842475414276
    float_data: 0.05372656136751175
    float_data: 0.2924717366695404
    float_data: -0.16408100724220276
    float_data: 0.3359265625476837
    float_data: -0.18974095582962036
    float_data: 0.21696531772613525
    float_data: -0.31183114647865295
    float_data: -0.1369820237159729
    float_data: -0.10138628631830215
    float_data: 0.03834318369626999
    float_data: -0.034818608313798904
    float_data: 0.4052979052066803
    float_data: -0.1416415274143219
    float_data: 0.3278486728668213
    float_data: -0.16481459140777588
    float_data: -0.14297011494636536
    float_data: 0.27584463357925415
    float_data: -0.10187884420156479
    float_data: -0.23870833218097687
    float_data: -0.1781705617904663
    float_data: 0.14341869950294495
    float_data: -0.08382014185190201
    float_data: 0.03711657598614693
    float_data: -0.07212121784687042
    float_data: 0.39369240403175354
    float_data: 0.3315380811691284
    float_data: -0.09391665458679199
    float_data: 0.09881085157394409
    float_data: -0.2646777927875519
    float_data: -0.12145555764436722
    float_data: 0.5374312400817871
    float_data: 0.11784320324659348
    float_data: -0.20589874684810638
    float_data: 0.3441859483718872
    float_data: -0.16101966798305511
    float_data: 0.37898287177085876
    float_data: 0.0013436091830953956
    float_data: -0.1123947873711586
    float_data: 0.08800941705703735
    float_data: 0.4261273443698883
    float_data: -0.030122095718979836
    float_data: 0.09265909343957901
    float_data: -0.11268623918294907
    float_data: -0.030732257291674614
    float_data: -0.19184339046478271
    float_data: 0.3392176032066345
    float_data: 0.38871315121650696
    float_data: 0.10954014211893082
    float_data: -0.12821133434772491
    float_data: 0.13672848045825958
    float_data: 0.15913057327270508
    float_data: -0.1688709259033203
    float_data: -0.10622593760490417
    float_data: -0.12179810553789139
    float_data: 0.09746208041906357
    float_data: -0.006472350563853979
    float_data: -0.09581021964550018
    float_data: 0.1721794754266739
    float_data: 0.10566606372594833
    float_data: 0.09944069385528564
    float_data: 0.09835218638181686
    float_data: -0.16637180745601654
    float_data: -0.15552091598510742
    float_data: -0.1505661904811859
    float_data: -0.15019969642162323
    float_data: -0.08019103109836578
    float_data: 0.11458239704370499
    float_data: 0.012352121993899345
    float_data: 0.016801809892058372
    float_data: 0.11002951115369797
    float_data: -0.11954957991838455
    float_data: -0.07022368907928467
    float_data: 0.027100179344415665
    float_data: 0.14961010217666626
    float_data: 0.019401604309678078
    float_data: -0.15125374495983124
    float_data: 0.09766320884227753
    float_data: 0.06882808357477188
    float_data: 0.253653347492218
    float_data: -0.008149650879204273
    float_data: -0.03789060562849045
    float_data: 0.17419128119945526
    float_data: -0.01269761472940445
    float_data: -0.14871956408023834
    float_data: -0.5289957523345947
    float_data: -0.13846927881240845
    float_data: -0.03927159309387207
    float_data: -0.46437788009643555
    float_data: -0.11447346955537796
    float_data: 0.2377038598060608
    float_data: 0.06846974045038223
    float_data: -0.07252131402492523
    float_data: -0.09103427082300186
    float_data: -0.07434814423322678
    float_data: 0.0028750693891197443
    float_data: 0.005878713447600603
    float_data: -0.13410760462284088
    float_data: -0.09543707221746445
    float_data: -0.28104111552238464
    float_data: -0.22879008948802948
    float_data: 0.11570508033037186
    float_data: 0.4496190547943115
    float_data: -0.42516812682151794
    float_data: 0.05183521658182144
    float_data: 0.14532458782196045
    float_data: -0.07405338436365128
    float_data: 0.22445541620254517
    float_data: -0.3259675204753876
    float_data: 0.042201898992061615
    float_data: -0.05505572631955147
    float_data: -0.013884478248655796
    float_data: -0.00785414595156908
    float_data: -0.2154104858636856
    float_data: -0.011295531876385212
    float_data: -0.02624719776213169
    float_data: -0.3138485848903656
    float_data: 0.3443664312362671
    float_data: -0.15436875820159912
    float_data: -0.07544421404600143
    float_data: -0.05612893030047417
    float_data: -0.131722092628479
    float_data: 0.3510891795158386
    float_data: -0.05083237960934639
    float_data: 0.3112635314464569
    float_data: 0.046878471970558167
    float_data: 0.14717631042003632
    float_data: -0.3806574046611786
    float_data: -0.00703582726418972
    float_data: -0.23994512856006622
    float_data: -0.08877314627170563
    float_data: -0.03895246237516403
    float_data: 0.22076883912086487
    float_data: -0.4490264356136322
    float_data: -0.10321848839521408
    float_data: 0.3153716027736664
    float_data: 0.41396424174308777
    float_data: 0.4644525945186615
    float_data: -0.034833043813705444
    float_data: -0.062192779034376144
    float_data: 0.056018296629190445
    float_data: 0.03973693773150444
    float_data: 0.42361319065093994
    float_data: 0.04084872081875801
    float_data: -0.10679386556148529
    float_data: 0.1772036999464035
    float_data: 0.26601719856262207
    float_data: -0.09372080117464066
    float_data: -0.11442112922668457
    float_data: 0.0846685916185379
    float_data: 0.18178978562355042
    float_data: -0.03364881873130798
    float_data: -0.010378982871770859
    float_data: -0.16826672852039337
    float_data: 0.16520573198795319
    float_data: -0.12199116498231888
    float_data: -0.11409308016300201
    float_data: -0.07758206129074097
    float_data: -0.02253715693950653
    float_data: -0.18989597260951996
    float_data: 0.003485695691779256
    float_data: 0.10414054244756699
    float_data: 0.17963017523288727
    float_data: -0.22224514186382294
    float_data: -0.3054080903530121
    float_data: -0.06319016218185425
    float_data: -0.1318199187517166
    float_data: -0.12139076739549637
    float_data: 0.1969706416130066
    float_data: 0.03596226125955582
    float_data: 0.12231411784887314
    float_data: 0.10143306106328964
    float_data: -0.10749078541994095
    float_data: -0.014380979351699352
    float_data: 0.007970952428877354
    float_data: 0.09887076914310455
    float_data: -0.12487579137086868
    float_data: 0.03484613075852394
    float_data: 0.06965868175029755
    float_data: -0.24389396607875824
    float_data: 0.005392116494476795
    float_data: -0.0020861043594777584
    float_data: 0.10635661333799362
    float_data: -0.05944349244236946
    float_data: 0.12387000024318695
    float_data: 0.02476872131228447
    float_data: -0.10051688551902771
    float_data: 0.09156794100999832
    float_data: 0.03563738241791725
    float_data: -0.14190153777599335
    float_data: -0.025915298610925674
    float_data: 0.05696703493595123
    float_data: 0.13316993415355682
    float_data: -0.1589222401380539
    float_data: 0.15165342390537262
    float_data: -0.039232950657606125
    float_data: 0.15072694420814514
    float_data: 0.03236332908272743
    float_data: 0.1495784968137741
    float_data: 0.05434349924325943
    float_data: 0.0226699598133564
    float_data: -0.13918067514896393
    float_data: 0.09947040677070618
    float_data: 0.02945118397474289
    float_data: 0.05650001019239426
    float_data: 0.0998007208108902
    float_data: 0.023838121443986893
    float_data: 0.060435183346271515
    float_data: -0.19968517124652863
    float_data: 0.0789107084274292
    float_data: -0.09764163196086884
    float_data: 0.11389187723398209
    float_data: 0.4816252589225769
    float_data: -0.035956449806690216
    float_data: -0.2516113817691803
    float_data: 0.1324882209300995
    float_data: -0.01790073700249195
    float_data: 0.43020254373550415
    float_data: -0.1064375564455986
    float_data: -0.2542470693588257
    float_data: -0.1514768898487091
    float_data: -0.3402639925479889
    float_data: -0.14968854188919067
    float_data: -0.19768233597278595
    float_data: 0.45771726965904236
    float_data: -0.07831745594739914
    float_data: -0.7403773069381714
    float_data: -0.26068857312202454
    float_data: 0.21012401580810547
    float_data: -0.0613340400159359
    float_data: 0.16235928237438202
    float_data: 0.17285719513893127
    float_data: 0.7501547932624817
    float_data: -0.023405928164720535
    float_data: 0.038787201046943665
    float_data: 0.025279730558395386
    float_data: 0.14470545947551727
    float_data: -0.6273820400238037
    float_data: 0.3759441077709198
    float_data: 0.24501173198223114
    float_data: -0.3038599491119385
    float_data: 0.1828315109014511
    float_data: -0.26240795850753784
    float_data: 0.32491356134414673
    float_data: 0.1369035542011261
    float_data: -0.20153379440307617
    float_data: -0.5217918753623962
    float_data: -0.2933580279350281
    float_data: 0.003951460123062134
    float_data: -0.08426493406295776
    float_data: -0.08526059985160828
    float_data: 0.1318911612033844
    float_data: -0.15740664303302765
    float_data: 0.24642051756381989
    float_data: -0.5748904347419739
    float_data: 0.2656834125518799
    float_data: 0.05847664922475815
    float_data: -0.5165934562683105
    float_data: 0.4707004129886627
    float_data: 0.0487055703997612
    float_data: -0.19920745491981506
    float_data: -0.6537865400314331
    float_data: 0.23377346992492676
    float_data: -0.07736101746559143
    float_data: -0.031899016350507736
    float_data: -0.35818028450012207
    float_data: -0.5319560170173645
    float_data: 0.19311928749084473
    float_data: -0.526508629322052
    float_data: -0.22999265789985657
    float_data: 0.4352700114250183
    float_data: -0.5896586179733276
    float_data: 0.5580191612243652
    float_data: 0.23876038193702698
    float_data: -0.061518117785453796
    float_data: 0.0036923373118042946
    float_data: -0.6428425908088684
    float_data: -0.38349658250808716
    float_data: -0.17027008533477783
    float_data: -0.07792085409164429
    float_data: -0.2741209864616394
    float_data: -0.14573121070861816
    float_data: 0.2826397716999054
    float_data: -0.15761986374855042
    float_data: -0.34038761258125305
    float_data: 0.24920718371868134
    float_data: -0.09880401939153671
    float_data: -0.046677153557538986
    float_data: 0.07466249912977219
    float_data: 0.06919533014297485
    float_data: 0.03767295181751251
    float_data: 0.09021347016096115
    float_data: -0.1921650618314743
    float_data: 0.08627304434776306
    float_data: 0.07300950586795807
    float_data: -0.0805692970752716
    float_data: -0.09128087013959885
    float_data: 0.03684845194220543
    float_data: -0.03617515787482262
    float_data: 0.08239450305700302
    float_data: -0.03053230047225952
    float_data: 0.09901442378759384
    float_data: 0.13767686486244202
    float_data: -0.06331801414489746
    float_data: -0.11235705018043518
    float_data: 0.1276572346687317
    float_data: 0.013435103930532932
    float_data: 0.15120550990104675
    float_data: 0.04345417767763138
    float_data: 0.15711461007595062
    float_data: 0.010142426937818527
    float_data: 0.0017328306566923857
    float_data: -0.11626528203487396
    float_data: -0.04580854997038841
    float_data: -0.15045814216136932
    float_data: -0.10802838206291199
    float_data: 0.07825969159603119
    float_data: -0.14939811825752258
    float_data: -0.20796620845794678
    float_data: 0.3532913625240326
    float_data: 0.10906827449798584
    float_data: 0.10459329932928085
    float_data: 0.22807130217552185
    float_data: -0.06293544173240662
    float_data: -0.019442351534962654
    float_data: 0.14435577392578125
    float_data: -0.02156209386885166
    float_data: -0.24594669044017792
    float_data: 0.04447045922279358
    float_data: 0.21472835540771484
    float_data: -0.10095348954200745
    float_data: 0.13568338751792908
    float_data: -0.3342475891113281
    float_data: 0.21280565857887268
    float_data: 0.3530045449733734
    float_data: -0.14435768127441406
    float_data: 0.12798753380775452
    float_data: 0.7548561692237854
    float_data: -0.020707296207547188
    float_data: -0.1604567915201187
    float_data: 0.196119025349617
    float_data: -0.09671316295862198
    float_data: -0.4219934344291687
    float_data: 0.35913026332855225
    float_data: 0.1776522397994995
    float_data: -0.3877880871295929
    float_data: 0.09219517558813095
    float_data: -0.14177419245243073
    float_data: 0.2723565697669983
    float_data: -0.1361342817544937
    float_data: -0.1607900857925415
    float_data: -0.3702395260334015
    float_data: 0.6993191242218018
    float_data: -0.17069301009178162
    float_data: -0.024417193606495857
    float_data: 0.42369648814201355
    float_data: 0.15512241423130035
    float_data: -0.42192283272743225
    float_data: 0.005501112900674343
    float_data: 0.34369075298309326
    float_data: -0.39204198122024536
    float_data: -0.418190598487854
    float_data: 0.20051100850105286
    float_data: 0.050352081656455994
    float_data: 0.025269368663430214
    float_data: -0.48340967297554016
    float_data: -0.4519330561161041
    float_data: -0.24013008177280426
    float_data: -0.11618672311306
    float_data: -0.1923702210187912
    float_data: 0.1728581339120865
    float_data: -0.0008027837029658258
    float_data: -0.12732261419296265
    float_data: -0.18283917009830475
    float_data: -0.18216174840927124
    float_data: -0.5871446132659912
    float_data: 0.22271287441253662
    float_data: -0.10053344070911407
    float_data: 0.5866276621818542
    float_data: 0.10770172625780106
    float_data: -0.20639590919017792
    float_data: 0.024924280121922493
    float_data: 0.22896593809127808
    float_data: -0.0008946724701672792
    float_data: -0.21482211351394653
    float_data: -0.1753411889076233
    float_data: -0.24728164076805115
    float_data: 0.22149893641471863
    float_data: -0.034220680594444275
    float_data: -0.09380802512168884
    float_data: -0.21077744662761688
    float_data: -0.3379153311252594
    float_data: -0.09305424988269806
    float_data: 0.12549200654029846
    float_data: 0.36676979064941406
    float_data: 0.23319785296916962
    float_data: 0.577090859413147
    float_data: -0.36179429292678833
    float_data: 0.03619810938835144
    float_data: 0.10429342091083527
    float_data: -0.9257514476776123
    float_data: -0.5091439485549927
    float_data: -0.10627766698598862
    float_data: -0.167131245136261
    float_data: 0.06141908839344978
    float_data: 0.1307847946882248
    float_data: 0.05946356803178787
    float_data: 0.060149744153022766
    float_data: -0.056813884526491165
    float_data: 0.15539029240608215
    float_data: -0.07421072572469711
    float_data: 0.013367273844778538
    float_data: -0.058926019817590714
    float_data: 0.13066980242729187
    float_data: -0.04238654300570488
    float_data: -0.025490131229162216
    float_data: 0.0033764997497200966
    float_data: 0.12471958994865417
    float_data: -0.1480276882648468
    float_data: 0.07568565011024475
    float_data: 0.1138957217335701
    float_data: -0.1478186994791031
    float_data: -0.001151047763414681
    float_data: -0.05535266175866127
    float_data: 0.11435359716415405
    float_data: 0.01861412264406681
    float_data: 0.0605115070939064
    float_data: -0.01499730721116066
    float_data: 0.040815118700265884
    float_data: -0.06677021831274033
    float_data: -0.15607628226280212
    float_data: 0.02441607229411602
    float_data: -0.05997961759567261
    float_data: 0.00549282506108284
    float_data: 0.13245874643325806
    float_data: -0.02338837832212448
    float_data: -0.08035334944725037
    float_data: -0.04094146937131882
    float_data: -0.04786403849720955
    float_data: 0.34932494163513184
    float_data: 0.24679842591285706
    float_data: 0.31645381450653076
    float_data: -0.003991075791418552
    float_data: -0.17528578639030457
    float_data: -0.10832594335079193
    float_data: -0.20524415373802185
    float_data: 0.009025974199175835
    float_data: 0.05653546750545502
    float_data: 0.3058703541755676
    float_data: 0.3906731605529785
    float_data: -0.03198457136750221
    float_data: 0.07301390916109085
    float_data: -0.45369023084640503
    float_data: -0.074477918446064
    float_data: -0.018845103681087494
    float_data: -0.194082573056221
    float_data: 0.30536124110221863
    float_data: 0.29223039746284485
    float_data: -0.1259668618440628
    float_data: -0.0819166824221611
    float_data: 0.2970889210700989
    float_data: -0.0025338667910546064
    float_data: -0.007378949783742428
    float_data: 0.2753102481365204
    float_data: 0.18457035720348358
    float_data: -0.2683107852935791
    float_data: -0.14265437424182892
    float_data: -0.0048142909072339535
    float_data: 0.21674427390098572
    float_data: -0.1742599904537201
    float_data: 0.007130259647965431
    float_data: -0.32155242562294006
    float_data: 0.19600273668766022
    float_data: 0.05819026008248329
    float_data: -0.19202162325382233
    float_data: -0.07074519246816635
    float_data: -0.06647749245166779
    float_data: 0.3046034872531891
    float_data: 0.050354283303022385
    float_data: 0.05913573130965233
    float_data: -0.16557182371616364
    float_data: -0.30810436606407166
    float_data: 0.04106879234313965
    float_data: 0.2017178237438202
    float_data: -0.03584608435630798
    float_data: -0.1411191076040268
    float_data: -0.09463617950677872
    float_data: -0.6417422294616699
    float_data: -0.2097586691379547
    float_data: 0.0046334718354046345
    float_data: -0.16851401329040527
    float_data: 0.21165110170841217
    float_data: -0.559312105178833
    float_data: 0.4930593967437744
    float_data: -0.16333217918872833
    float_data: -0.21802619099617004
    float_data: 0.28218358755111694
    float_data: -0.3253032863140106
    float_data: 0.07300153374671936
    float_data: 0.31080174446105957
    float_data: 0.025576617568731308
    float_data: 0.4717031419277191
    float_data: -0.2611788809299469
    float_data: -0.2080283910036087
    float_data: -0.06997734308242798
    float_data: 0.5065919756889343
    float_data: -0.27706220746040344
    float_data: -0.19577226042747498
    float_data: 0.48544085025787354
    float_data: -0.16089527308940887
    float_data: -0.02721649780869484
    float_data: 0.48228418827056885
    float_data: 0.18707813322544098
    float_data: -0.11577194929122925
    float_data: 0.7126471996307373
    float_data: 0.10026729851961136
    float_data: 0.5051303505897522
    float_data: 0.09653788059949875
    float_data: -0.014318267814815044
    float_data: -0.10595539212226868
    float_data: -0.08982336521148682
    float_data: -0.3576917350292206
    float_data: -0.12027882784605026
    float_data: 0.3324926793575287
    float_data: 0.009657537564635277
    float_data: 0.14172028005123138
    float_data: 0.5335022211074829
    float_data: 0.07005293667316437
    float_data: -0.02298676408827305
    float_data: 0.09787890315055847
    float_data: -0.04659057781100273
    float_data: -0.09107421338558197
    float_data: 0.08502323180437088
    float_data: -0.06087101995944977
    float_data: 0.07419528067111969
    float_data: 0.07776693999767303
    float_data: -0.08862373977899551
    float_data: -0.09094095975160599
    float_data: -0.09576470404863358
    float_data: -0.11371495574712753
    float_data: -0.0391000397503376
    float_data: -0.15057972073554993
    float_data: -0.12376627326011658
    float_data: 0.06549040973186493
    float_data: 0.10597033053636551
    float_data: -0.13878948986530304
    float_data: -0.08533060550689697
    float_data: -0.0926957055926323
    float_data: 0.1327725201845169
    float_data: 0.06746917217969894
    float_data: 0.014079705812036991
    float_data: -0.06756316870450974
    float_data: 0.07572988420724869
    float_data: -0.019535429775714874
    float_data: 0.13525941967964172
    float_data: 0.044591017067432404
    float_data: -0.000826717761810869
    float_data: -0.12116139382123947
    float_data: 0.3061063289642334
    float_data: 0.4088935852050781
    float_data: -0.013242628425359726
    float_data: 0.20404012501239777
    float_data: 0.03458363562822342
    float_data: -0.1357990801334381
    float_data: 0.06194422394037247
    float_data: -0.3693804144859314
    float_data: -0.5485491156578064
    float_data: -0.07900190353393555
    float_data: -0.055813148617744446
    float_data: 0.16003765165805817
    float_data: 0.09396189451217651
    float_data: 0.23353508114814758
    float_data: 0.16507169604301453
    float_data: -0.2612411677837372
    float_data: -0.5502786636352539
    float_data: 0.5375643968582153
    float_data: -0.0518917478621006
    float_data: 0.20496688783168793
    float_data: -0.2526247203350067
    float_data: 0.043662186712026596
    float_data: -0.5162009596824646
    float_data: -0.031826313585042953
    float_data: 0.17327764630317688
    float_data: 0.09189649671316147
    float_data: 0.2714052200317383
    float_data: -0.19408871233463287
    float_data: -0.2703811228275299
    float_data: -0.02492319978773594
    float_data: 0.4997194707393646
    float_data: -0.32307958602905273
    float_data: 0.10904184728860855
    float_data: 0.22444847226142883
    float_data: 0.019785793498158455
    float_data: -0.10284634679555893
    float_data: -0.19239455461502075
    float_data: -0.4593372941017151
    float_data: -0.17104984819889069
    float_data: 0.0005040690302848816
    float_data: 0.20488376915454865
    float_data: 0.15111474692821503
    float_data: -0.2588220536708832
    float_data: 0.5636773109436035
    float_data: -0.6369231939315796
    float_data: 0.3187830150127411
    float_data: -0.06954038888216019
    float_data: -0.37691792845726013
    float_data: 0.4906269609928131
    float_data: 0.1817094087600708
    float_data: 0.018392110243439674
    float_data: 0.0017755177104845643
    float_data: 0.21353356540203094
    float_data: -0.00689422944560647
    float_data: -0.24203673005104065
    float_data: 0.3357134461402893
    float_data: 0.17110799252986908
    float_data: -0.543160617351532
    float_data: -0.08326750248670578
    float_data: 0.19025766849517822
    float_data: -0.2118573635816574
    float_data: 0.25729620456695557
    float_data: -0.09175501018762589
    float_data: 0.21612122654914856
    float_data: 0.07122970372438431
    float_data: -0.02090587466955185
    float_data: -0.07356176525354385
    float_data: 0.09454387426376343
    float_data: -0.1779509335756302
    float_data: 0.16275353729724884
    float_data: -0.20152077078819275
    float_data: 0.3686736524105072
    float_data: -0.05806439369916916
    float_data: -0.31045129895210266
    float_data: 0.5403907299041748
    float_data: -0.2051708698272705
    float_data: 0.3533249795436859
    float_data: 0.0678848996758461
    float_data: 0.1778310239315033
    float_data: 0.03411979228258133
    float_data: -0.12419650703668594
    float_data: -0.104562908411026
    float_data: 0.5165917873382568
    float_data: -0.25724801421165466
    float_data: 0.296044260263443
    float_data: -0.05477016419172287
    float_data: 0.24116572737693787
    float_data: 0.04492158442735672
    float_data: -0.14828833937644958
    float_data: -0.00946266483515501
    float_data: -0.01951659470796585
    float_data: 0.10382606089115143
    float_data: -0.022637484595179558
    float_data: -0.04864351451396942
    float_data: 0.05576179176568985
    float_data: -0.08882270008325577
    float_data: -0.010477821342647076
    float_data: -0.05597824603319168
    float_data: 0.04076538607478142
    float_data: 0.12156157195568085
    float_data: -0.016157420352101326
    float_data: 0.09092433750629425
    float_data: -0.013438103720545769
    float_data: 0.048492010682821274
    float_data: -0.12102312594652176
    float_data: -0.00020085269352421165
    float_data: 0.13225427269935608
    float_data: 0.04439776763319969
    float_data: 0.08434729278087616
    float_data: -0.002334361197426915
    float_data: -0.0006109777023084462
    float_data: 0.10811600834131241
    float_data: -0.14277242124080658
    float_data: 0.018303798511624336
    float_data: 0.05476529896259308
    float_data: 0.0063033089973032475
    float_data: -0.09796276688575745
    float_data: 0.03621293231844902
    float_data: -0.061337366700172424
    float_data: 0.05242045968770981
    float_data: 0.2132285237312317
    float_data: 0.3725718855857849
    float_data: 0.12578733265399933
    float_data: 0.06248350813984871
    float_data: -0.21929608285427094
    float_data: 0.14719220995903015
    float_data: -0.1510772407054901
    float_data: -0.28382307291030884
    float_data: -0.04733135923743248
    float_data: -0.2588338255882263
    float_data: 0.08406759053468704
    float_data: -0.14423483610153198
    float_data: -0.011859037913382053
    float_data: 0.2376476377248764
    float_data: -0.1631692498922348
    float_data: 0.1731090396642685
    float_data: -0.15706422924995422
    float_data: 0.31446558237075806
    float_data: -0.05009590461850166
    float_data: -0.02626035176217556
    float_data: -0.012526985257863998
    float_data: -0.1353234499692917
    float_data: 0.19410541653633118
    float_data: 0.19880858063697815
    float_data: 0.2212240844964981
    float_data: -0.21335814893245697
    float_data: 0.2440991997718811
    float_data: 0.040364596992731094
    float_data: -0.00038202214636839926
    float_data: 0.08557950705289841
    float_data: -0.18239019811153412
    float_data: -0.020330652594566345
    float_data: 0.21758298575878143
    float_data: 0.2598664462566376
    float_data: -0.4524684548377991
    float_data: -0.029590118676424026
    float_data: -0.08372566103935242
    float_data: 0.33667853474617004
    float_data: 0.08309681713581085
    float_data: 0.15008290112018585
    float_data: 0.06117943301796913
    float_data: -0.31910544633865356
    float_data: 0.3281009793281555
    float_data: 0.08660455793142319
    float_data: 0.003863891353830695
    float_data: -0.3358222544193268
    float_data: -0.09926564246416092
    float_data: 0.066842220723629
    float_data: -0.21864478290081024
    float_data: -0.26294487714767456
    float_data: -0.1422656774520874
    float_data: -0.020642876625061035
    float_data: -0.3591524660587311
    float_data: 0.2971838116645813
    float_data: -0.2807992696762085
    float_data: -0.1965400129556656
    float_data: -0.29139259457588196
    float_data: 0.33645859360694885
    float_data: 0.4629444181919098
    float_data: -0.59955894947052
    float_data: -0.2613658607006073
    float_data: -0.5801758170127869
    float_data: 0.3371083438396454
    float_data: -0.33610597252845764
    float_data: -0.031104817986488342
    float_data: 0.036878786981105804
    float_data: -0.2113111913204193
    float_data: -0.30385762453079224
    float_data: 0.5575822591781616
    float_data: 0.30846619606018066
    float_data: -0.10102861374616623
    float_data: -0.11366981267929077
    float_data: 0.2577466070652008
    float_data: -0.07448695600032806
    float_data: -0.31493058800697327
    float_data: -0.12274562567472458
    float_data: -0.19943685829639435
    float_data: -0.03728029876947403
    float_data: 0.08786877244710922
    float_data: 0.07984144240617752
    float_data: -0.12212838977575302
    float_data: -0.08527279645204544
    float_data: -0.111409991979599
    float_data: 0.1486021727323532
    float_data: 0.3870849013328552
    float_data: -0.13111941516399384
    float_data: 0.18444514274597168
    float_data: 0.0973399206995964
    float_data: -0.4718190133571625
    float_data: 0.019496841356158257
    float_data: 0.14938704669475555
    float_data: -0.07100866734981537
    float_data: -0.17645585536956787
    float_data: 0.04141691327095032
    float_data: 0.09963061660528183
    float_data: 0.03535215184092522
    float_data: 0.04525888338685036
    float_data: -0.019937705248594284
    float_data: -0.10404771566390991
    float_data: -0.39265206456184387
    float_data: 0.1635439097881317
    float_data: -0.17770497500896454
    float_data: -0.04480159282684326
    float_data: 0.18070194125175476
    float_data: -0.030460773035883904
    float_data: -0.10883792489767075
    float_data: -0.05065121129155159
    float_data: -0.07175211608409882
    float_data: 0.10942169278860092
    float_data: 0.09340039640665054
    float_data: -0.02333568036556244
    float_data: 0.03369645029306412
    float_data: -0.11296815425157547
    float_data: 0.003288398729637265
    float_data: -0.05690811201930046
    float_data: 0.11432506889104843
    float_data: 0.054314740002155304
    float_data: 0.045491378754377365
    float_data: -0.11875428259372711
    float_data: -0.010411186143755913
    float_data: 0.03485720232129097
    float_data: 0.1711660474538803
    float_data: 0.04356246069073677
    float_data: -0.16114190220832825
    float_data: -0.02052871137857437
    float_data: 0.00970537681132555
    float_data: -0.01768483966588974
    float_data: -0.015281729400157928
    float_data: 0.08074643462896347
    float_data: 0.1663796603679657
    float_data: 0.02280469238758087
    float_data: 0.044168658554553986
    float_data: 0.2261544018983841
    float_data: 0.021118784323334694
    float_data: 0.1472046822309494
    float_data: -0.34842994809150696
    float_data: 0.33988454937934875
    float_data: -0.07362110167741776
    float_data: 0.21132145822048187
    float_data: -0.1003941223025322
    float_data: -0.2455984205007553
    float_data: -0.16965292394161224
    float_data: 0.06430362164974213
    float_data: 0.10048200935125351
    float_data: -0.06809937953948975
    float_data: -0.10377679765224457
    float_data: -0.37618201971054077
    float_data: 0.30944812297821045
    float_data: 0.15399086475372314
    float_data: 0.16053178906440735
    float_data: -0.061300959438085556
    float_data: -0.28740838170051575
    float_data: -0.17005929350852966
    float_data: 0.15235015749931335
    float_data: -0.07003895193338394
    float_data: -0.26449882984161377
    float_data: -0.21203070878982544
    float_data: 0.2130514681339264
    float_data: 0.30285903811454773
    float_data: 0.2267862856388092
    float_data: 0.181195467710495
    float_data: 0.03196033835411072
    float_data: -0.007384093012660742
    float_data: 0.12876936793327332
    float_data: -0.0551888570189476
    float_data: -0.08126048743724823
    float_data: -0.026636827737092972
    float_data: 0.08118585497140884
    float_data: -0.1305803656578064
    float_data: 0.3034306764602661
    float_data: -0.1540665179491043
    float_data: 0.020397761836647987
    float_data: -0.17560960352420807
    float_data: -0.027978062629699707
    float_data: 0.0398123562335968
    float_data: -0.1863151341676712
    float_data: -0.02381630428135395
    float_data: 0.2605438828468323
    float_data: -0.12053605914115906
    float_data: -0.2034687101840973
    float_data: -0.20273490250110626
    float_data: -0.36625826358795166
    float_data: 0.24667589366436005
    float_data: -0.03744308650493622
    float_data: 0.07372365891933441
    float_data: -0.12682977318763733
    float_data: -0.11007026582956314
    float_data: 0.24839943647384644
    float_data: 0.3201574981212616
    float_data: 0.08068434149026871
    float_data: 0.1210097000002861
    float_data: -0.37963560223579407
    float_data: 0.2542749345302582
    float_data: 0.21033331751823425
    float_data: -0.3684030771255493
    float_data: 0.006469255313277245
    float_data: -0.19410154223442078
    float_data: -0.05493360385298729
    float_data: 0.024245837703347206
    float_data: -0.27527162432670593
    float_data: 0.14617249369621277
    float_data: -0.13232304155826569
    float_data: -0.36733096837997437
    float_data: 0.23528899252414703
    float_data: 0.1936909556388855
    float_data: -0.22635780274868011
    float_data: -0.286517471075058
    float_data: 0.26790329813957214
    float_data: 0.00536737684160471
    float_data: -0.035668302327394485
    float_data: 0.5262371897697449
    float_data: -0.19041702151298523
    float_data: -0.09030263870954514
    float_data: -0.21110835671424866
    float_data: -0.05666990950703621
    float_data: -0.03626405447721481
    float_data: 0.04676351323723793
    float_data: -0.010125933215022087
    float_data: -0.04107106104493141
    float_data: -0.255275696516037
    float_data: 0.2039797455072403
    float_data: -0.1591818928718567
    float_data: -0.1400657594203949
    float_data: 0.35469940304756165
    float_data: 0.006054983474314213
    name: "coefficient"
  }
  initializer {
    dims: 1
    dims: 15
    data_type: 1
    float_data: 0.14839275181293488
    float_data: 0.14317254722118378
    float_data: 0.06474119424819946
    float_data: 0.16194602847099304
    float_data: -0.1810845583677292
    float_data: -0.1476978361606598
    float_data: -0.020632795989513397
    float_data: -0.06583362817764282
    float_data: 0.13078628480434418
    float_data: 0.03745127096772194
    float_data: -0.006112152244895697
    float_data: 0.11117950826883316
    float_data: -0.005456527695059776
    float_data: 0.10421690344810486
    float_data: -0.0777653157711029
    name: "intercepts"
  }
  initializer {
    dims: 15
    dims: 10
    data_type: 1
    float_data: -0.7782423496246338
    float_data: 1.3600561618804932
    float_data: -0.7403428554534912
    float_data: -1.7157111167907715
    float_data: 1.2952311038970947
    float_data: -2.5111546516418457
    float_data: -1.13767671585083
    float_data: 1.1708245277404785
    float_data: 1.3978404998779297
    float_data: 0.9643582701683044
    float_data: 1.2126597166061401
    float_data: -1.045486330986023
    float_data: -1.9886473417282104
    float_data: 0.7427359223365784
    float_data: 1.448570728302002
    float_data: 1.599191427230835
    float_data: -1.880115270614624
    float_data: 0.8571935296058655
    float_data: -2.8664817810058594
    float_data: 2.2126519680023193
    float_data: 2.6495728492736816
    float_data: -0.7089135646820068
    float_data: 0.7065654993057251
    float_data: -0.2737945020198822
    float_data: -0.029806112870573997
    float_data: -1.547080397605896
    float_data: 2.4844326972961426
    float_data: -0.41071248054504395
    float_data: -1.1279810667037964
    float_data: -1.0327328443527222
    float_data: 0.9410222172737122
    float_data: -1.6770555973052979
    float_data: -0.7899423837661743
    float_data: -1.391512155532837
    float_data: 1.5879360437393188
    float_data: 1.7197108268737793
    float_data: 1.3198089599609375
    float_data: 1.8414885997772217
    float_data: -1.8536688089370728
    float_data: -2.404895544052124
    float_data: 0.38799864053726196
    float_data: 0.23723851144313812
    float_data: -1.40082585811615
    float_data: -3.4921748638153076
    float_data: 0.6799563765525818
    float_data: 1.0219402313232422
    float_data: 0.4245302379131317
    float_data: -2.259768009185791
    float_data: 2.0900282859802246
    float_data: 1.8501869440078735
    float_data: -0.2455446720123291
    float_data: 0.22063082456588745
    float_data: 0.09304066002368927
    float_data: 0.14857997000217438
    float_data: 0.20784412324428558
    float_data: -0.2073039710521698
    float_data: -0.16240264475345612
    float_data: -0.24677902460098267
    float_data: -0.04677269235253334
    float_data: 0.21284672617912292
    float_data: -0.22353346645832062
    float_data: 0.03177790716290474
    float_data: -0.21521440148353577
    float_data: 0.09372088313102722
    float_data: 0.18329328298568726
    float_data: -0.19202472269535065
    float_data: 0.007448703981935978
    float_data: -0.13171707093715668
    float_data: 0.23366615176200867
    float_data: 0.19001828134059906
    float_data: -2.1258704662323
    float_data: 1.4194358587265015
    float_data: -2.297593593597412
    float_data: 1.8213505744934082
    float_data: -1.494384527206421
    float_data: 1.0481376647949219
    float_data: 0.7414661645889282
    float_data: 0.7046638131141663
    float_data: -0.8606182336807251
    float_data: 1.643331527709961
    float_data: -0.8863994479179382
    float_data: 1.6412124633789062
    float_data: 1.740450382232666
    float_data: 0.8335509300231934
    float_data: -1.9550024271011353
    float_data: 1.21028470993042
    float_data: 0.13888391852378845
    float_data: -2.7037267684936523
    float_data: 1.5775034427642822
    float_data: -1.3973478078842163
    float_data: 0.04716625064611435
    float_data: -2.3157713413238525
    float_data: 1.8581825494766235
    float_data: 0.46716299653053284
    float_data: -2.06034779548645
    float_data: -0.5483012199401855
    float_data: 0.8672881126403809
    float_data: 0.42215824127197266
    float_data: 1.4902851581573486
    float_data: -0.09109096974134445
    float_data: -1.1484259366989136
    float_data: 1.977744460105896
    float_data: -1.1093769073486328
    float_data: -0.5240243673324585
    float_data: 1.5318046808242798
    float_data: -1.215706706047058
    float_data: 1.9802379608154297
    float_data: 0.42092010378837585
    float_data: -1.313368558883667
    float_data: -0.5047862529754639
    float_data: 1.1732606887817383
    float_data: -1.0918247699737549
    float_data: -1.3291884660720825
    float_data: -1.4048322439193726
    float_data: 1.7158832550048828
    float_data: 1.1328387260437012
    float_data: 1.1739548444747925
    float_data: -1.8114491701126099
    float_data: 1.4197280406951904
    float_data: -0.9333571791648865
    float_data: 1.729805588722229
    float_data: -1.0917149782180786
    float_data: 1.3181161880493164
    float_data: 2.2315258979797363
    float_data: -0.7606163024902344
    float_data: -1.1383285522460938
    float_data: -0.44411081075668335
    float_data: -1.3915143013000488
    float_data: -1.7454010248184204
    float_data: 1.3526021242141724
    float_data: -1.5491641759872437
    float_data: 1.7795525789260864
    float_data: 2.259329319000244
    float_data: 0.2876286506652832
    float_data: 0.6958253383636475
    float_data: 0.7699112892150879
    float_data: -1.5418670177459717
    float_data: 1.4598157405853271
    float_data: -1.1303845643997192
    float_data: -2.757742166519165
    float_data: 0.9724425077438354
    float_data: -1.773850917816162
    float_data: -1.8825526237487793
    float_data: 2.1189663410186768
    float_data: -1.8996142148971558
    float_data: 0.6511226296424866
    float_data: -1.8557755947113037
    float_data: 1.5214473009109497
    float_data: 0.7638227939605713
    float_data: 0.7190506458282471
    name: "coefficient1"
  }
  initializer {
    dims: 1
    dims: 10
    data_type: 1
    float_data: -0.4245036244392395
    float_data: 0.3654501438140869
    float_data: 1.264304280281067
    float_data: -0.29421886801719666
    float_data: -0.31427282094955444
    float_data: -0.9248428344726562
    float_data: -0.3145067095756531
    float_data: 0.12269353866577148
    float_data: 0.6104782819747925
    float_data: -0.12194615602493286
    name: "intercepts1"
  }
  initializer {
    dims: 10
    data_type: 6
    int32_data: 0
    int32_data: 1
    int32_data: 2
    int32_data: 3
    int32_data: 4
    int32_data: 5
    int32_data: 6
    int32_data: 7
    int32_data: 8
    int32_data: 9
    name: "classes"
  }
  initializer {
    dims: 1
    data_type: 7
    int64_data: -1
    name: "shape_tensor"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "output_label"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "output_probability"
    type {
      sequence_type {
        elem_type {
          map_type {
            key_type: 7
            value_type {
              tensor_type {
                elem_type: 1
              }
            }
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 9
}
opset_import {
  domain: "ai.onnx.ml"
  version: 1
}
